# Python 101 整數格式化輸出
#TQC+ 程式語言Python 101 整數格式化輸出
#最新一次更新時間：2019-04-16 00:27:01

#1. 題目說明:
#請開啟PYD101.py檔案，依下列題意進行作答，輸入整數及進行格式化輸出，使輸出值符合題意要求。作答完成請另存新檔為PYA101.py再進行評分。

#2. 設計說明：
#請撰寫一程式，輸入四個整數，然後將這四個整數以欄寬為5、欄與欄間隔一個空白字元，再以每列印兩個的方式，先列印向右靠齊，再列印向左靠齊，左右皆以直線 |（Vertical bar）作為邊界。

#3. 輸入輸出：
#輸入說明
#四個整數

#輸出說明
#格式化輸出

#範例輸入
#85
#4
#299
#478
#範例輸出
#|   85     4|
#|  299   478|
#|85    4    |
#|299   478  |
#4. 評分項目：
#項目	配分	得分
#(1) 符合設計說明輸出正確格式	10	0
#總 分	10	0
#================================================================================

#New========================================================

#TODO

num1 = int(input())
num2 = int(input())
num3 = int(input())
num4 = int(input())


#向右靠齊
#TODO

print("|{0:5d} {1:5d}|".format(num1, num2))
print("|{0:5d} {1:5d}|".format(num3, num4))


#向左靠齊
#TODO

print("|{0:<5d} {1:<5d}|".format(num1, num2))
print("|{0:<5d} {1:<5d}|".format(num3, num4))

#==============================================================================

runfile('D:/我的書桌/code judge/TQC+ 程式語言Python 101 整數格式化輸出/PYD101.py', wdir='D:/我的書桌/code judge/TQC+ 程式語言Python 101 整數格式化輸出')

85

4

299

478
|   85     4|
|  299   478|
|85    4    |
|299   478  |


# Old===============================================================================

#TODO

num1 = int(input())
num2 = int(input())
num3 = int(input())
num4 = int(input())


#向右靠齊
#TODO

print("|%5d %5d|"%(num1, num2))
print("|%5d %5d|"%(num3, num4))


#向左靠齊
#TODO

print("|%-5d %-5d|"%(num1, num2))
print("|%-5d %-5d|"%(num3, num4))


============================================================

runfile('D:/我的書桌/code judge/TQC+ 程式語言Python 101 整數格式化輸出/PYD101.py', wdir='D:/我的書桌/code judge/TQC+ 程式語言Python 101 整數格式化輸出')

85

4

299

478
|   85     4|
|  299   478|
|85    4    |
|299   478  |